Revit 2027 API
PipeFittingAndAccessoryData.ServerGUID Property
 The GUID of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid ServerGUID { get; }
Public ReadOnly Property ServerGUID As Guid
	Get
public:
property Guid ServerGUID {
	Guid get ();
}
member ServerGUID : Guid with get
Property Value
Guid
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace